grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_fs_device.h
#pragma once 

/* --- OTG_FS_DEVICE: USB on the go high speed ---------------------- */

/** @defgroup otg_fs_device_registers USB on the go high speed Register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DCFG OTG_HS device configuration register **/
#define OTG_FS_DEVICE_OTG_HS_DCFG			MMIO32(OTG_FS_DEVICE_BASE + 0x00)
/** OTG_FS_DEVICE_OTG_HS_DCTL OTG_HS device control register **/
#define OTG_FS_DEVICE_OTG_HS_DCTL			MMIO32(OTG_FS_DEVICE_BASE + 0x04)
/** OTG_FS_DEVICE_OTG_HS_DSTS OTG_HS device status register **/
#define OTG_FS_DEVICE_OTG_HS_DSTS			MMIO32(OTG_FS_DEVICE_BASE + 0x08)
/** OTG_FS_DEVICE_OTG_HS_DIEPMSK OTG_HS device IN endpoint common interrupt mask register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPMSK			MMIO32(OTG_FS_DEVICE_BASE + 0x10)
/** OTG_FS_DEVICE_OTG_HS_DOEPMSK OTG_HS device OUT endpoint common interrupt mask register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPMSK			MMIO32(OTG_FS_DEVICE_BASE + 0x14)
/** OTG_FS_DEVICE_OTG_HS_DAINT OTG_HS device all endpoints interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DAINT			MMIO32(OTG_FS_DEVICE_BASE + 0x18)
/** OTG_FS_DEVICE_OTG_HS_DAINTMSK OTG_HS all endpoints interrupt mask register **/
#define OTG_FS_DEVICE_OTG_HS_DAINTMSK			MMIO32(OTG_FS_DEVICE_BASE + 0x1c)
/** OTG_FS_DEVICE_OTG_HS_DVBUSDIS OTG_HS device VBUS discharge time register **/
#define OTG_FS_DEVICE_OTG_HS_DVBUSDIS			MMIO32(OTG_FS_DEVICE_BASE + 0x28)
/** OTG_FS_DEVICE_OTG_HS_DVBUSPULSE OTG_HS device VBUS pulsing time register **/
#define OTG_FS_DEVICE_OTG_HS_DVBUSPULSE			MMIO32(OTG_FS_DEVICE_BASE + 0x2c)
/** OTG_FS_DEVICE_OTG_HS_DTHRCTL OTG_HS Device threshold control register **/
#define OTG_FS_DEVICE_OTG_HS_DTHRCTL			MMIO32(OTG_FS_DEVICE_BASE + 0x30)
/** OTG_FS_DEVICE_OTG_HS_DIEPEMPMSK OTG_HS device IN endpoint FIFO empty interrupt mask register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPEMPMSK			MMIO32(OTG_FS_DEVICE_BASE + 0x34)
/** OTG_FS_DEVICE_OTG_HS_DEACHINT OTG_HS device each endpoint interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DEACHINT			MMIO32(OTG_FS_DEVICE_BASE + 0x38)
/** OTG_FS_DEVICE_OTG_HS_DEACHINTMSK OTG_HS device each endpoint interrupt register mask **/
#define OTG_FS_DEVICE_OTG_HS_DEACHINTMSK			MMIO32(OTG_FS_DEVICE_BASE + 0x3c)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL0 OTG device endpoint-0 control register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL0			MMIO32(OTG_FS_DEVICE_BASE + 0x100)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT0 OTG device endpoint-0 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT0			MMIO32(OTG_FS_DEVICE_BASE + 0x108)
/** OTG_FS_DEVICE_OTG_HS_DIEPTSIZ0 OTG_HS device IN endpoint 0 transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ0			MMIO32(OTG_FS_DEVICE_BASE + 0x110)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA0 OTG_HS device endpoint-1 DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA0			MMIO32(OTG_FS_DEVICE_BASE + 0x114)
/** OTG_FS_DEVICE_OTG_HS_DTXFSTS0 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG_FS_DEVICE_OTG_HS_DTXFSTS0			MMIO32(OTG_FS_DEVICE_BASE + 0x118)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL1 OTG device endpoint-1 control register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL1			MMIO32(OTG_FS_DEVICE_BASE + 0x120)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT1 OTG device endpoint-1 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT1			MMIO32(OTG_FS_DEVICE_BASE + 0x128)
/** OTG_FS_DEVICE_OTG_HS_DIEPTSIZ1 OTG_HS device endpoint transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ1			MMIO32(OTG_FS_DEVICE_BASE + 0x130)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA1 OTG_HS device endpoint-2 DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA1			MMIO32(OTG_FS_DEVICE_BASE + 0x134)
/** OTG_FS_DEVICE_OTG_HS_DTXFSTS1 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG_FS_DEVICE_OTG_HS_DTXFSTS1			MMIO32(OTG_FS_DEVICE_BASE + 0x138)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL2 OTG device endpoint-2 control register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL2			MMIO32(OTG_FS_DEVICE_BASE + 0x140)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT2 OTG device endpoint-2 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT2			MMIO32(OTG_FS_DEVICE_BASE + 0x148)
/** OTG_FS_DEVICE_OTG_HS_DIEPTSIZ2 OTG_HS device endpoint transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ2			MMIO32(OTG_FS_DEVICE_BASE + 0x150)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA2 OTG_HS device endpoint-3 DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA2			MMIO32(OTG_FS_DEVICE_BASE + 0x154)
/** OTG_FS_DEVICE_OTG_HS_DTXFSTS2 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG_FS_DEVICE_OTG_HS_DTXFSTS2			MMIO32(OTG_FS_DEVICE_BASE + 0x158)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL3 OTG device endpoint-3 control register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL3			MMIO32(OTG_FS_DEVICE_BASE + 0x160)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT3 OTG device endpoint-3 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT3			MMIO32(OTG_FS_DEVICE_BASE + 0x168)
/** OTG_FS_DEVICE_OTG_HS_DIEPTSIZ3 OTG_HS device endpoint transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ3			MMIO32(OTG_FS_DEVICE_BASE + 0x170)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA3 OTG_HS device endpoint-4 DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA3			MMIO32(OTG_FS_DEVICE_BASE + 0x174)
/** OTG_FS_DEVICE_OTG_HS_DTXFSTS3 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG_FS_DEVICE_OTG_HS_DTXFSTS3			MMIO32(OTG_FS_DEVICE_BASE + 0x178)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL4 OTG device endpoint-4 control register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4			MMIO32(OTG_FS_DEVICE_BASE + 0x180)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT4 OTG device endpoint-4 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT4			MMIO32(OTG_FS_DEVICE_BASE + 0x188)
/** OTG_FS_DEVICE_OTG_HS_DIEPTSIZ4 OTG_HS device endpoint transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ4			MMIO32(OTG_FS_DEVICE_BASE + 0x190)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA4 OTG_HS device endpoint-5 DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA4			MMIO32(OTG_FS_DEVICE_BASE + 0x194)
/** OTG_FS_DEVICE_OTG_HS_DTXFSTS4 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG_FS_DEVICE_OTG_HS_DTXFSTS4			MMIO32(OTG_FS_DEVICE_BASE + 0x198)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL5 OTG device endpoint-5 control register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5			MMIO32(OTG_FS_DEVICE_BASE + 0x1a0)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT5 OTG device endpoint-5 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT5			MMIO32(OTG_FS_DEVICE_BASE + 0x1a8)
/** OTG_FS_DEVICE_OTG_HS_DIEPTSIZ5 OTG_HS device endpoint transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ5			MMIO32(OTG_FS_DEVICE_BASE + 0x1b0)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA5 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA5			MMIO32(OTG_FS_DEVICE_BASE + 0x1b4)
/** OTG_FS_DEVICE_OTG_HS_DTXFSTS5 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG_FS_DEVICE_OTG_HS_DTXFSTS5			MMIO32(OTG_FS_DEVICE_BASE + 0x1b8)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL6 OTG device endpoint-6 control register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL6			MMIO32(OTG_FS_DEVICE_BASE + 0x1c0)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT6 OTG device endpoint-6 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT6			MMIO32(OTG_FS_DEVICE_BASE + 0x1c8)
/** OTG_FS_DEVICE_OTG_HS_DIEPTSIZ6 OTG_HS device endpoint transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ6			MMIO32(OTG_FS_DEVICE_BASE + 0x1d0)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA6 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA6			MMIO32(OTG_FS_DEVICE_BASE + 0x1d4)
/** OTG_FS_DEVICE_OTG_HS_DTXFSTS6 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG_FS_DEVICE_OTG_HS_DTXFSTS6			MMIO32(OTG_FS_DEVICE_BASE + 0x1d8)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL7 OTG device endpoint-7 control register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL7			MMIO32(OTG_FS_DEVICE_BASE + 0x1e0)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT7 OTG device endpoint-7 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT7			MMIO32(OTG_FS_DEVICE_BASE + 0x1e8)
/** OTG_FS_DEVICE_OTG_HS_DIEPTSIZ7 OTG_HS device endpoint transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ7			MMIO32(OTG_FS_DEVICE_BASE + 0x1f0)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA7 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA7			MMIO32(OTG_FS_DEVICE_BASE + 0x1f4)
/** OTG_FS_DEVICE_OTG_HS_DTXFSTS7 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG_FS_DEVICE_OTG_HS_DTXFSTS7			MMIO32(OTG_FS_DEVICE_BASE + 0x1f8)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA8 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA8			MMIO32(OTG_FS_DEVICE_BASE + 0x214)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA9 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA9			MMIO32(OTG_FS_DEVICE_BASE + 0x234)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA10 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA10			MMIO32(OTG_FS_DEVICE_BASE + 0x254)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA11 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA11			MMIO32(OTG_FS_DEVICE_BASE + 0x274)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA12 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA12			MMIO32(OTG_FS_DEVICE_BASE + 0x294)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA13 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA13			MMIO32(OTG_FS_DEVICE_BASE + 0x2b4)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA14 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA14			MMIO32(OTG_FS_DEVICE_BASE + 0x2d4)
/** OTG_FS_DEVICE_OTG_HS_DIEPDMA15 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA15			MMIO32(OTG_FS_DEVICE_BASE + 0x2f4)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL0 OTG_HS device control OUT endpoint 0 control register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL0			MMIO32(OTG_FS_DEVICE_BASE + 0x300)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT0 OTG_HS device endpoint-0 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT0			MMIO32(OTG_FS_DEVICE_BASE + 0x308)
/** OTG_FS_DEVICE_OTG_HS_DOEPTSIZ0 OTG_HS device endpoint-0 transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ0			MMIO32(OTG_FS_DEVICE_BASE + 0x310)
/** OTG_FS_DEVICE_OTG_HS_DOEPDMA0 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPDMA0			MMIO32(OTG_FS_DEVICE_BASE + 0x314)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL1 OTG device endpoint-1 control register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL1			MMIO32(OTG_FS_DEVICE_BASE + 0x320)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT1 OTG_HS device endpoint-1 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT1			MMIO32(OTG_FS_DEVICE_BASE + 0x328)
/** OTG_FS_DEVICE_OTG_HS_DOEPTSIZ1 OTG_HS device endpoint-1 transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ1			MMIO32(OTG_FS_DEVICE_BASE + 0x330)
/** OTG_FS_DEVICE_OTG_HS_DOEPDMA1 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPDMA1			MMIO32(OTG_FS_DEVICE_BASE + 0x334)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL2 OTG device endpoint-2 control register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL2			MMIO32(OTG_FS_DEVICE_BASE + 0x340)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT2 OTG_HS device endpoint-2 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT2			MMIO32(OTG_FS_DEVICE_BASE + 0x348)
/** OTG_FS_DEVICE_OTG_HS_DOEPTSIZ2 OTG_HS device endpoint-2 transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ2			MMIO32(OTG_FS_DEVICE_BASE + 0x350)
/** OTG_FS_DEVICE_OTG_HS_DOEPDMA2 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPDMA2			MMIO32(OTG_FS_DEVICE_BASE + 0x354)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL3 OTG device endpoint-3 control register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL3			MMIO32(OTG_FS_DEVICE_BASE + 0x360)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT3 OTG_HS device endpoint-3 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT3			MMIO32(OTG_FS_DEVICE_BASE + 0x368)
/** OTG_FS_DEVICE_OTG_HS_DOEPTSIZ3 OTG_HS device endpoint-3 transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ3			MMIO32(OTG_FS_DEVICE_BASE + 0x370)
/** OTG_FS_DEVICE_OTG_HS_DOEPDMA3 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPDMA3			MMIO32(OTG_FS_DEVICE_BASE + 0x374)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL4 OTG device endpoint-4 control register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL4			MMIO32(OTG_FS_DEVICE_BASE + 0x380)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT4 OTG_HS device endpoint-4 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT4			MMIO32(OTG_FS_DEVICE_BASE + 0x388)
/** OTG_FS_DEVICE_OTG_HS_DOEPTSIZ4 OTG_HS device endpoint-4 transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ4			MMIO32(OTG_FS_DEVICE_BASE + 0x390)
/** OTG_FS_DEVICE_OTG_HS_DOEPDMA4 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPDMA4			MMIO32(OTG_FS_DEVICE_BASE + 0x394)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL5 OTG device endpoint-5 control register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5			MMIO32(OTG_FS_DEVICE_BASE + 0x3a0)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT5 OTG_HS device endpoint-5 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT5			MMIO32(OTG_FS_DEVICE_BASE + 0x3a8)
/** OTG_FS_DEVICE_OTG_HS_DOEPTSIZ5 OTG_HS device endpoint-5 transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ5			MMIO32(OTG_FS_DEVICE_BASE + 0x3b0)
/** OTG_FS_DEVICE_OTG_HS_DOEPDMA5 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPDMA5			MMIO32(OTG_FS_DEVICE_BASE + 0x3b4)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL6 OTG device endpoint-6 control register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6			MMIO32(OTG_FS_DEVICE_BASE + 0x3c0)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT6 OTG_HS device endpoint-6 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT6			MMIO32(OTG_FS_DEVICE_BASE + 0x3c8)
/** OTG_FS_DEVICE_OTG_HS_DOEPTSIZ6 OTG_HS device endpoint-6 transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ6			MMIO32(OTG_FS_DEVICE_BASE + 0x3d0)
/** OTG_FS_DEVICE_OTG_HS_DOEPDMA6 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPDMA6			MMIO32(OTG_FS_DEVICE_BASE + 0x3d4)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL7 OTG device endpoint-7 control register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL7			MMIO32(OTG_FS_DEVICE_BASE + 0x3e0)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT7 OTG_HS device endpoint-7 interrupt register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT7			MMIO32(OTG_FS_DEVICE_BASE + 0x3e8)
/** OTG_FS_DEVICE_OTG_HS_DOEPTSIZ7 OTG_HS device endpoint-7 transfer size register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ7			MMIO32(OTG_FS_DEVICE_BASE + 0x3f0)
/** OTG_FS_DEVICE_OTG_HS_DOEPDMA7 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPDMA7			MMIO32(OTG_FS_DEVICE_BASE + 0x3f4)
/** OTG_FS_DEVICE_OTG_HS_DOEPDMA8 OTG Device channel-x DMA address register **/
#define OTG_FS_DEVICE_OTG_HS_DOEPDMA8			MMIO32(OTG_FS_DEVICE_BASE + 0x414)

/**@}*/


/** @defgroup otg_fs_device_otg_hs_dcfg OTGHSDCFG OTG_HS device configuration register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DCFG_PERSCHIVL_SHIFT		24
#define OTG_FS_DEVICE_OTG_HS_DCFG_PERSCHIVL_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_dcfg_perschivl PERSCHIVL Periodic scheduling interval
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DCFG_PFIVL_SHIFT		11
#define OTG_FS_DEVICE_OTG_HS_DCFG_PFIVL_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_dcfg_pfivl PFIVL Periodic (micro)frame interval
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DCFG_DAD_SHIFT		4
#define OTG_FS_DEVICE_OTG_HS_DCFG_DAD_MASK		0x7f
/** @defgroup otg_fs_device_otg_hs_dcfg_dad DAD Device address
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_HS_DCFG_NZLSOHSK Nonzero-length status OUT handshake **/
#define OTG_FS_DEVICE_OTG_HS_DCFG_NZLSOHSK		(1 << 2)

#define OTG_FS_DEVICE_OTG_HS_DCFG_DSPD_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DCFG_DSPD_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_dcfg_dspd DSPD Device speed
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_dctl OTGHSDCTL OTG_HS device control register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DCTL_POPRGDNE Power-on programming done **/
#define OTG_FS_DEVICE_OTG_HS_DCTL_POPRGDNE		(1 << 11)
/** OTG_FS_DEVICE_OTG_HS_DCTL_CGONAK Clear global OUT NAK **/
#define OTG_FS_DEVICE_OTG_HS_DCTL_CGONAK		(1 << 10)
/** OTG_FS_DEVICE_OTG_HS_DCTL_SGONAK Set global OUT NAK **/
#define OTG_FS_DEVICE_OTG_HS_DCTL_SGONAK		(1 << 9)
/** OTG_FS_DEVICE_OTG_HS_DCTL_CGINAK Clear global IN NAK **/
#define OTG_FS_DEVICE_OTG_HS_DCTL_CGINAK		(1 << 8)
/** OTG_FS_DEVICE_OTG_HS_DCTL_SGINAK Set global IN NAK **/
#define OTG_FS_DEVICE_OTG_HS_DCTL_SGINAK		(1 << 7)

#define OTG_FS_DEVICE_OTG_HS_DCTL_TCTL_SHIFT		4
#define OTG_FS_DEVICE_OTG_HS_DCTL_TCTL_MASK		0x07
/** @defgroup otg_fs_device_otg_hs_dctl_tctl TCTL Test control
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_HS_DCTL_GONSTS Global OUT NAK status **/
#define OTG_FS_DEVICE_OTG_HS_DCTL_GONSTS		(1 << 3)
/** OTG_FS_DEVICE_OTG_HS_DCTL_GINSTS Global IN NAK status **/
#define OTG_FS_DEVICE_OTG_HS_DCTL_GINSTS		(1 << 2)
/** OTG_FS_DEVICE_OTG_HS_DCTL_SDIS Soft disconnect **/
#define OTG_FS_DEVICE_OTG_HS_DCTL_SDIS		(1 << 1)
/** OTG_FS_DEVICE_OTG_HS_DCTL_RWUSIG Remote wakeup signaling **/
#define OTG_FS_DEVICE_OTG_HS_DCTL_RWUSIG		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_hs_dsts OTGHSDSTS OTG_HS device status register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DSTS_FNSOF_SHIFT		8
#define OTG_FS_DEVICE_OTG_HS_DSTS_FNSOF_MASK		0x3fff
/** @defgroup otg_fs_device_otg_hs_dsts_fnsof FNSOF Frame number of the received SOF
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_HS_DSTS_EERR Erratic error **/
#define OTG_FS_DEVICE_OTG_HS_DSTS_EERR		(1 << 3)

#define OTG_FS_DEVICE_OTG_HS_DSTS_ENUMSPD_SHIFT		1
#define OTG_FS_DEVICE_OTG_HS_DSTS_ENUMSPD_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_dsts_enumspd ENUMSPD Enumerated speed
@{*/
/**@}*/

