grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_fs_device.h
/** OTG_FS_DEVICE_OTG_HS_DSTS_SUSPSTS Suspend status **/
#define OTG_FS_DEVICE_OTG_HS_DSTS_SUSPSTS		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepmsk OTGHSDIEPMSK OTG_HS device IN endpoint common interrupt mask register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DIEPMSK_BIM BNA interrupt mask **/
#define OTG_FS_DEVICE_OTG_HS_DIEPMSK_BIM		(1 << 9)
/** OTG_FS_DEVICE_OTG_HS_DIEPMSK_TXFURM FIFO underrun mask **/
#define OTG_FS_DEVICE_OTG_HS_DIEPMSK_TXFURM		(1 << 8)
/** OTG_FS_DEVICE_OTG_HS_DIEPMSK_INEPNEM IN endpoint NAK effective mask **/
#define OTG_FS_DEVICE_OTG_HS_DIEPMSK_INEPNEM		(1 << 6)
/** OTG_FS_DEVICE_OTG_HS_DIEPMSK_INEPNMM IN token received with EP mismatch mask **/
#define OTG_FS_DEVICE_OTG_HS_DIEPMSK_INEPNMM		(1 << 5)
/** OTG_FS_DEVICE_OTG_HS_DIEPMSK_ITTXFEMSK IN token received when TxFIFO empty mask **/
#define OTG_FS_DEVICE_OTG_HS_DIEPMSK_ITTXFEMSK		(1 << 4)
/** OTG_FS_DEVICE_OTG_HS_DIEPMSK_TOM Timeout condition mask (nonisochronous endpoints) **/
#define OTG_FS_DEVICE_OTG_HS_DIEPMSK_TOM		(1 << 3)
/** OTG_FS_DEVICE_OTG_HS_DIEPMSK_EPDM Endpoint disabled interrupt mask **/
#define OTG_FS_DEVICE_OTG_HS_DIEPMSK_EPDM		(1 << 1)
/** OTG_FS_DEVICE_OTG_HS_DIEPMSK_XFRCM Transfer completed interrupt mask **/
#define OTG_FS_DEVICE_OTG_HS_DIEPMSK_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_hs_doepmsk OTGHSDOEPMSK OTG_HS device OUT endpoint common interrupt mask register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DOEPMSK_BOIM BNA interrupt mask **/
#define OTG_FS_DEVICE_OTG_HS_DOEPMSK_BOIM		(1 << 9)
/** OTG_FS_DEVICE_OTG_HS_DOEPMSK_OPEM OUT packet error mask **/
#define OTG_FS_DEVICE_OTG_HS_DOEPMSK_OPEM		(1 << 8)
/** OTG_FS_DEVICE_OTG_HS_DOEPMSK_B2BSTUP Back-to-back SETUP packets received mask **/
#define OTG_FS_DEVICE_OTG_HS_DOEPMSK_B2BSTUP		(1 << 6)
/** OTG_FS_DEVICE_OTG_HS_DOEPMSK_OTEPDM OUT token received when endpoint disabled mask **/
#define OTG_FS_DEVICE_OTG_HS_DOEPMSK_OTEPDM		(1 << 4)
/** OTG_FS_DEVICE_OTG_HS_DOEPMSK_STUPM SETUP phase done mask **/
#define OTG_FS_DEVICE_OTG_HS_DOEPMSK_STUPM		(1 << 3)
/** OTG_FS_DEVICE_OTG_HS_DOEPMSK_EPDM Endpoint disabled interrupt mask **/
#define OTG_FS_DEVICE_OTG_HS_DOEPMSK_EPDM		(1 << 1)
/** OTG_FS_DEVICE_OTG_HS_DOEPMSK_XFRCM Transfer completed interrupt mask **/
#define OTG_FS_DEVICE_OTG_HS_DOEPMSK_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_hs_daint OTGHSDAINT OTG_HS device all endpoints interrupt register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DAINT_OEPINT_SHIFT		16
#define OTG_FS_DEVICE_OTG_HS_DAINT_OEPINT_MASK		0xffff
/** @defgroup otg_fs_device_otg_hs_daint_oepint OEPINT OUT endpoint interrupt bits
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DAINT_IEPINT_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DAINT_IEPINT_MASK		0xffff
/** @defgroup otg_fs_device_otg_hs_daint_iepint IEPINT IN endpoint interrupt bits
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_daintmsk OTGHSDAINTMSK OTG_HS all endpoints interrupt mask register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DAINTMSK_OEPM_SHIFT		16
#define OTG_FS_DEVICE_OTG_HS_DAINTMSK_OEPM_MASK		0xffff
/** @defgroup otg_fs_device_otg_hs_daintmsk_oepm OEPM OUT EP interrupt mask bits
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DAINTMSK_IEPM_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DAINTMSK_IEPM_MASK		0xffff
/** @defgroup otg_fs_device_otg_hs_daintmsk_iepm IEPM IN EP interrupt mask bits
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_dvbusdis OTGHSDVBUSDIS OTG_HS device VBUS discharge time register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DVBUSDIS_VBUSDT_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DVBUSDIS_VBUSDT_MASK		0xffff
/** @defgroup otg_fs_device_otg_hs_dvbusdis_vbusdt VBUSDT Device VBUS discharge time
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_dvbuspulse OTGHSDVBUSPULSE OTG_HS device VBUS pulsing time register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DVBUSPULSE_DVBUSP_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DVBUSPULSE_DVBUSP_MASK		0xfff
/** @defgroup otg_fs_device_otg_hs_dvbuspulse_dvbusp DVBUSP Device VBUS pulsing time
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_dthrctl OTGHSDTHRCTL OTG_HS Device threshold control register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DTHRCTL_ARPEN Arbiter parking enable **/
#define OTG_FS_DEVICE_OTG_HS_DTHRCTL_ARPEN		(1 << 27)

#define OTG_FS_DEVICE_OTG_HS_DTHRCTL_RXTHRLEN_SHIFT		17
#define OTG_FS_DEVICE_OTG_HS_DTHRCTL_RXTHRLEN_MASK		0x1ff
/** @defgroup otg_fs_device_otg_hs_dthrctl_rxthrlen RXTHRLEN Receive threshold length
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_HS_DTHRCTL_RXTHREN Receive threshold enable **/
#define OTG_FS_DEVICE_OTG_HS_DTHRCTL_RXTHREN		(1 << 16)

#define OTG_FS_DEVICE_OTG_HS_DTHRCTL_TXTHRLEN_SHIFT		2
#define OTG_FS_DEVICE_OTG_HS_DTHRCTL_TXTHRLEN_MASK		0x1ff
/** @defgroup otg_fs_device_otg_hs_dthrctl_txthrlen TXTHRLEN Transmit threshold length
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_HS_DTHRCTL_ISOTHREN ISO IN endpoint threshold enable **/
#define OTG_FS_DEVICE_OTG_HS_DTHRCTL_ISOTHREN		(1 << 1)
/** OTG_FS_DEVICE_OTG_HS_DTHRCTL_NONISOTHREN Nonisochronous IN endpoints threshold enable **/
#define OTG_FS_DEVICE_OTG_HS_DTHRCTL_NONISOTHREN		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepempmsk OTGHSDIEPEMPMSK OTG_HS device IN endpoint FIFO empty interrupt mask register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DIEPEMPMSK_INEPTXFEM_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DIEPEMPMSK_INEPTXFEM_MASK		0xffff
/** @defgroup otg_fs_device_otg_hs_diepempmsk_ineptxfem INEPTXFEM IN EP Tx FIFO empty interrupt mask bits
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_deachint OTGHSDEACHINT OTG_HS device each endpoint interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DEACHINT_OEP1INT OUT endpoint 1 interrupt bit **/
#define OTG_FS_DEVICE_OTG_HS_DEACHINT_OEP1INT		(1 << 17)
/** OTG_FS_DEVICE_OTG_HS_DEACHINT_IEP1INT IN endpoint 1interrupt bit **/
#define OTG_FS_DEVICE_OTG_HS_DEACHINT_IEP1INT		(1 << 1)

/**@}*/

/** @defgroup otg_fs_device_otg_hs_deachintmsk OTGHSDEACHINTMSK OTG_HS device each endpoint interrupt register mask
@{*/

/** OTG_FS_DEVICE_OTG_HS_DEACHINTMSK_OEP1INTM OUT Endpoint 1 interrupt mask bit **/
#define OTG_FS_DEVICE_OTG_HS_DEACHINTMSK_OEP1INTM		(1 << 17)
/** OTG_FS_DEVICE_OTG_HS_DEACHINTMSK_IEP1INTM IN Endpoint 1 interrupt mask bit **/
#define OTG_FS_DEVICE_OTG_HS_DEACHINTMSK_IEP1INTM		(1 << 1)

/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepctl0 OTGHSDIEPCTL0 OTG device endpoint-0 control register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DIEPCTL0_EPENA Endpoint enable **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL0_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL0_EPDIS Endpoint disable **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL0_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL0_SODDFRM Set odd frame **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL0_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL0_SD0PID_SEVNFRM Set DATA0 PID **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL0_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL0_SNAK Set NAK **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL0_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL0_CNAK Clear NAK **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL0_CNAK		(1 << 26)

#define OTG_FS_DEVICE_OTG_HS_DIEPCTL0_TXFNUM_SHIFT		22
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL0_TXFNUM_MASK		0x0f
/** @defgroup otg_fs_device_otg_hs_diepctl0_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

