grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_fs_device.h
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL3_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL3_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_otg_hs_diepctl3_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepint3 OTGHSDIEPINT3 OTG device endpoint-3 interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DIEPINT3_NAK NAK interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT3_NAK		(1 << 13)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT3_BERR Babble error interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT3_BERR		(1 << 12)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT3_PKTDRPSTS Packet dropped status **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT3_PKTDRPSTS		(1 << 11)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT3_BNA Buffer not available interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT3_BNA		(1 << 9)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT3_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT3_TXFIFOUDRN		(1 << 8)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT3_TXFE Transmit FIFO empty **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT3_TXFE		(1 << 7)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT3_INEPNE IN endpoint NAK effective **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT3_INEPNE		(1 << 6)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT3_ITTXFE IN token received when TxFIFO is empty **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT3_ITTXFE		(1 << 4)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT3_TOC Timeout condition **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT3_TOC		(1 << 3)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT3_EPDISD Endpoint disabled interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT3_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT3_XFRC Transfer completed interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT3_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_hs_dieptsiz3 OTGHSDIEPTSIZ3 OTG_HS device endpoint transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ3_MCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ3_MCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_dieptsiz3_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ3_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ3_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_otg_hs_dieptsiz3_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ3_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ3_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_otg_hs_dieptsiz3_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepdma3 OTGHSDIEPDMA3 OTG_HS device endpoint-4 DMA address register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DIEPDMA3_DMAADDR_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA3_DMAADDR_MASK		0xffffffff
/** @defgroup otg_fs_device_otg_hs_diepdma3_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_dtxfsts3 OTGHSDTXFSTS3 OTG_HS device IN endpoint transmit FIFO status register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DTXFSTS3_INEPTFSAV_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DTXFSTS3_INEPTFSAV_MASK		0xffff
/** @defgroup otg_fs_device_otg_hs_dtxfsts3_ineptfsav INEPTFSAV IN endpoint TxFIFO space avail
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepctl4 OTGHSDIEPCTL4 OTG device endpoint-4 control register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DIEPCTL4_EPENA Endpoint enable **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL4_EPDIS Endpoint disable **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL4_SODDFRM Set odd frame **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL4_SD0PID_SEVNFRM Set DATA0 PID **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL4_SNAK Set NAK **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL4_CNAK Clear NAK **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_CNAK		(1 << 26)

#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_TXFNUM_SHIFT		22
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_TXFNUM_MASK		0x0f
/** @defgroup otg_fs_device_otg_hs_diepctl4_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_HS_DIEPCTL4_Stall STALL handshake **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_Stall		(1 << 21)

#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_diepctl4_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_HS_DIEPCTL4_NAKSTS NAK status **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL4_EONUM_DPID Even/odd frame **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_EONUM_DPID		(1 << 16)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL4_USBAEP USB active endpoint **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL4_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_otg_hs_diepctl4_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepint4 OTGHSDIEPINT4 OTG device endpoint-4 interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DIEPINT4_NAK NAK interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT4_NAK		(1 << 13)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT4_BERR Babble error interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT4_BERR		(1 << 12)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT4_PKTDRPSTS Packet dropped status **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT4_PKTDRPSTS		(1 << 11)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT4_BNA Buffer not available interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT4_BNA		(1 << 9)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT4_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT4_TXFIFOUDRN		(1 << 8)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT4_TXFE Transmit FIFO empty **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT4_TXFE		(1 << 7)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT4_INEPNE IN endpoint NAK effective **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT4_INEPNE		(1 << 6)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT4_ITTXFE IN token received when TxFIFO is empty **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT4_ITTXFE		(1 << 4)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT4_TOC Timeout condition **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT4_TOC		(1 << 3)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT4_EPDISD Endpoint disabled interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT4_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT4_XFRC Transfer completed interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT4_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_hs_dieptsiz4 OTGHSDIEPTSIZ4 OTG_HS device endpoint transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ4_MCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ4_MCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_dieptsiz4_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ4_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ4_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_otg_hs_dieptsiz4_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ4_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ4_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_otg_hs_dieptsiz4_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepdma4 OTGHSDIEPDMA4 OTG_HS device endpoint-5 DMA address register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DIEPDMA4_DMAADDR_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DIEPDMA4_DMAADDR_MASK		0xffffffff
/** @defgroup otg_fs_device_otg_hs_diepdma4_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

