grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_fs_device.h
/** @defgroup otg_fs_device_otg_hs_dtxfsts4 OTGHSDTXFSTS4 OTG_HS device IN endpoint transmit FIFO status register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DTXFSTS4_INEPTFSAV_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DTXFSTS4_INEPTFSAV_MASK		0xffff
/** @defgroup otg_fs_device_otg_hs_dtxfsts4_ineptfsav INEPTFSAV IN endpoint TxFIFO space avail
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepctl5 OTGHSDIEPCTL5 OTG device endpoint-5 control register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DIEPCTL5_EPENA Endpoint enable **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL5_EPDIS Endpoint disable **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL5_SODDFRM Set odd frame **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL5_SD0PID_SEVNFRM Set DATA0 PID **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL5_SNAK Set NAK **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL5_CNAK Clear NAK **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_CNAK		(1 << 26)

#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_TXFNUM_SHIFT		22
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_TXFNUM_MASK		0x0f
/** @defgroup otg_fs_device_otg_hs_diepctl5_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_HS_DIEPCTL5_Stall STALL handshake **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_Stall		(1 << 21)

#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_diepctl5_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_HS_DIEPCTL5_NAKSTS NAK status **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL5_EONUM_DPID Even/odd frame **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_EONUM_DPID		(1 << 16)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL5_USBAEP USB active endpoint **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_otg_hs_diepctl5_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepint5 OTGHSDIEPINT5 OTG device endpoint-5 interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DIEPINT5_NAK NAK interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT5_NAK		(1 << 13)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT5_BERR Babble error interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT5_BERR		(1 << 12)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT5_PKTDRPSTS Packet dropped status **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT5_PKTDRPSTS		(1 << 11)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT5_BNA Buffer not available interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT5_BNA		(1 << 9)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT5_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT5_TXFIFOUDRN		(1 << 8)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT5_TXFE Transmit FIFO empty **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT5_TXFE		(1 << 7)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT5_INEPNE IN endpoint NAK effective **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT5_INEPNE		(1 << 6)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT5_ITTXFE IN token received when TxFIFO is empty **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT5_ITTXFE		(1 << 4)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT5_TOC Timeout condition **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT5_TOC		(1 << 3)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT5_EPDISD Endpoint disabled interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT5_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_OTG_HS_DIEPINT5_XFRC Transfer completed interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DIEPINT5_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_hs_dieptsiz5 OTGHSDIEPTSIZ5 OTG_HS device endpoint transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ5_MCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ5_MCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_dieptsiz5_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ5_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ5_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_otg_hs_dieptsiz5_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ5_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ5_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_otg_hs_dieptsiz5_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepdma5 OTGHSDIEPDMA5 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_dtxfsts5 OTGHSDTXFSTS5 OTG_HS device IN endpoint transmit FIFO status register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DTXFSTS5_INEPTFSAV_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DTXFSTS5_INEPTFSAV_MASK		0xffff
/** @defgroup otg_fs_device_otg_hs_dtxfsts5_ineptfsav INEPTFSAV IN endpoint TxFIFO space avail
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepctl6 OTGHSDIEPCTL6 OTG device endpoint-6 control register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DIEPCTL6_EPENA Endpoint enable **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL6_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL6_EPDIS Endpoint disable **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL6_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL6_SODDFRM Set odd frame **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL6_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL6_SD0PID_SEVNFRM Set DATA0 PID **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL6_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL6_SNAK Set NAK **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL6_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_HS_DIEPCTL6_CNAK Clear NAK **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL6_CNAK		(1 << 26)

#define OTG_FS_DEVICE_OTG_HS_DIEPCTL6_TXFNUM_SHIFT		22
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL6_TXFNUM_MASK		0x0f
/** @defgroup otg_fs_device_otg_hs_diepctl6_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_HS_DIEPCTL6_Stall STALL handshake **/
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL6_Stall		(1 << 21)

#define OTG_FS_DEVICE_OTG_HS_DIEPCTL6_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_OTG_HS_DIEPCTL6_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_diepctl6_eptyp EPTYP Endpoint type
@{*/
/**@}*/

