grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_fs_device.h
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ7_MCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ7_MCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_dieptsiz7_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ7_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ7_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_otg_hs_dieptsiz7_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ7_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DIEPTSIZ7_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_otg_hs_dieptsiz7_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepdma7 OTGHSDIEPDMA7 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_dtxfsts7 OTGHSDTXFSTS7 OTG_HS device IN endpoint transmit FIFO status register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DTXFSTS7_INEPTFSAV_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DTXFSTS7_INEPTFSAV_MASK		0xffff
/** @defgroup otg_fs_device_otg_hs_dtxfsts7_ineptfsav INEPTFSAV IN endpoint TxFIFO space avail
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepdma8 OTGHSDIEPDMA8 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepdma9 OTGHSDIEPDMA9 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepdma10 OTGHSDIEPDMA10 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepdma11 OTGHSDIEPDMA11 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepdma12 OTGHSDIEPDMA12 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepdma13 OTGHSDIEPDMA13 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepdma14 OTGHSDIEPDMA14 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_diepdma15 OTGHSDIEPDMA15 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_doepctl0 OTGHSDOEPCTL0 OTG_HS device control OUT endpoint 0 control register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DOEPCTL0_EPENA Endpoint enable **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL0_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL0_EPDIS Endpoint disable **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL0_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL0_SNAK Set NAK **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL0_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL0_CNAK Clear NAK **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL0_CNAK		(1 << 26)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL0_Stall STALL handshake **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL0_Stall		(1 << 21)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL0_SNPM Snoop mode **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL0_SNPM		(1 << 20)

#define OTG_FS_DEVICE_OTG_HS_DOEPCTL0_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL0_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_doepctl0_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_HS_DOEPCTL0_NAKSTS NAK status **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL0_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL0_USBAEP USB active endpoint **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL0_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_OTG_HS_DOEPCTL0_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL0_MPSIZ_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_doepctl0_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_doepint0 OTGHSDOEPINT0 OTG_HS device endpoint-0 interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DOEPINT0_NYET NYET interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT0_NYET		(1 << 14)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT0_B2BSTUP Back-to-back SETUP packets received **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT0_B2BSTUP		(1 << 6)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT0_OTEPDIS OUT token received when endpoint disabled **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT0_OTEPDIS		(1 << 4)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT0_STUP SETUP phase done **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT0_STUP		(1 << 3)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT0_EPDISD Endpoint disabled interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT0_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT0_XFRC Transfer completed interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT0_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_hs_doeptsiz0 OTGHSDOEPTSIZ0 OTG_HS device endpoint-0 transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_doeptsiz0_stupcnt STUPCNT SETUP packet count
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_HS_DOEPTSIZ0_PKTCNT Packet count **/
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ0_PKTCNT		(1 << 19)

#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ0_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ0_XFRSIZ_MASK		0x7f
/** @defgroup otg_fs_device_otg_hs_doeptsiz0_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_doepdma0 OTGHSDOEPDMA0 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_doepctl1 OTGHSDOEPCTL1 OTG device endpoint-1 control register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DOEPCTL1_EPENA Endpoint enable **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL1_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL1_EPDIS Endpoint disable **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL1_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL1_SODDFRM Set odd frame **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL1_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL1_SD0PID_SEVNFRM Set DATA0 PID/Set even frame **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL1_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL1_SNAK Set NAK **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL1_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL1_CNAK Clear NAK **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL1_CNAK		(1 << 26)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL1_Stall STALL handshake **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL1_Stall		(1 << 21)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL1_SNPM Snoop mode **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL1_SNPM		(1 << 20)

