grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_fs_device.h
/** @defgroup otg_fs_device_otg_hs_doeptsiz4 OTGHSDOEPTSIZ4 OTG_HS device endpoint-4 transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_doeptsiz4_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_otg_hs_doeptsiz4_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_otg_hs_doeptsiz4_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_doepdma4 OTGHSDOEPDMA4 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_doepctl5 OTGHSDOEPCTL5 OTG device endpoint-5 control register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DOEPCTL5_EPENA Endpoint enable **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL5_EPDIS Endpoint disable **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL5_SODDFRM Set odd frame **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL5_SD0PID_SEVNFRM Set DATA0 PID/Set even frame **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL5_SNAK Set NAK **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL5_CNAK Clear NAK **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5_CNAK		(1 << 26)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL5_Stall STALL handshake **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5_Stall		(1 << 21)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL5_SNPM Snoop mode **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5_SNPM		(1 << 20)

#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_doepctl5_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_HS_DOEPCTL5_NAKSTS NAK status **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL5_EONUM_DPID Even odd frame/Endpoint data PID **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5_EONUM_DPID		(1 << 16)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL5_USBAEP USB active endpoint **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL5_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_otg_hs_doepctl5_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_doepint5 OTGHSDOEPINT5 OTG_HS device endpoint-5 interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DOEPINT5_NYET NYET interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT5_NYET		(1 << 14)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT5_B2BSTUP Back-to-back SETUP packets received **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT5_B2BSTUP		(1 << 6)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT5_OTEPDIS OUT token received when endpoint disabled **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT5_OTEPDIS		(1 << 4)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT5_STUP SETUP phase done **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT5_STUP		(1 << 3)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT5_EPDISD Endpoint disabled interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT5_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT5_XFRC Transfer completed interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT5_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_hs_doeptsiz5 OTGHSDOEPTSIZ5 OTG_HS device endpoint-5 transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ5_RXDPID_STUPCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ5_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_doeptsiz5_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ5_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ5_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_otg_hs_doeptsiz5_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ5_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ5_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_otg_hs_doeptsiz5_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_doepdma5 OTGHSDOEPDMA5 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_doepctl6 OTGHSDOEPCTL6 OTG device endpoint-6 control register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DOEPCTL6_EPENA Endpoint enable **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL6_EPDIS Endpoint disable **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL6_SODDFRM Set odd frame **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL6_SD0PID_SEVNFRM Set DATA0 PID/Set even frame **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL6_SNAK Set NAK **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL6_CNAK Clear NAK **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6_CNAK		(1 << 26)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL6_Stall STALL handshake **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6_Stall		(1 << 21)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL6_SNPM Snoop mode **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6_SNPM		(1 << 20)

#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_doepctl6_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_HS_DOEPCTL6_NAKSTS NAK status **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL6_EONUM_DPID Even odd frame/Endpoint data PID **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6_EONUM_DPID		(1 << 16)
/** OTG_FS_DEVICE_OTG_HS_DOEPCTL6_USBAEP USB active endpoint **/
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DOEPCTL6_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_otg_hs_doepctl6_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_doepint6 OTGHSDOEPINT6 OTG_HS device endpoint-6 interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_HS_DOEPINT6_NYET NYET interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT6_NYET		(1 << 14)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT6_B2BSTUP Back-to-back SETUP packets received **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT6_B2BSTUP		(1 << 6)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT6_OTEPDIS OUT token received when endpoint disabled **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT6_OTEPDIS		(1 << 4)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT6_STUP SETUP phase done **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT6_STUP		(1 << 3)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT6_EPDISD Endpoint disabled interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT6_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_OTG_HS_DOEPINT6_XFRC Transfer completed interrupt **/
#define OTG_FS_DEVICE_OTG_HS_DOEPINT6_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_hs_doeptsiz6 OTGHSDOEPTSIZ6 OTG_HS device endpoint-6 transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ6_RXDPID_STUPCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ6_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_hs_doeptsiz6_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ6_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ6_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_otg_hs_doeptsiz6_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ6_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_HS_DOEPTSIZ6_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_otg_hs_doeptsiz6_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_hs_doepdma6 OTGHSDOEPDMA6 OTG Device channel-x DMA address register
@{*/


/**@}*/

